#summary Abelian extensions of some Rig quandles

With Rig one can compute abelian extensions of quandles. Let us compute some
examples. Some of these examples will be recognized as Rig quandles. 

== Q(4,1) ==

Let us construct the abelian extensions of `SmallQuandle(4,1)`. The 2nd
quandle cohomology group is of abelian type `[ 2 ]`. There is only one non-trivial
2-cocycle, say with values in the group generated by the permutation `(1,2)`. 

There is only one non-trivial abelian extension:
{{{
    gap> r := SmallQuandle(4,1);;
    gap> f := 2ndQuandleCohomologyGenerators(4,1).generators[1];;
    gap> s := AbelianExtension(r, Group(Flat(f)), f);;
    gap> IdQuandle(s);
    [ 8, 1 ]
}}}

== Q(6,1) ==

Let us construct the abelian extensions of `SmallQuandle(6,1)`. 
The 2nd quandle cohomology group is of abelian type `[ 2 ]`. There is only one non-trivial 2-cocycle, say with values in the group generated by the permutation `(1,2)`. We construct Q(12,1) as an abelian extension of Q(6,1):

{{{
gap> r := SmallQuandle(6,1);
gap> f := 2ndQuandleCohomologyGenerators(6,1).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
gap> IdQuandle(s);
[ 12, 1 ]
}}}

== Q(6,2) ==

Here we have another example. We construct Q(24,2) as an abelian extension of Q(6,2):

{{{
gap> r := SmallQuandle(6,2);;
gap> f := 2ndQuandleCohomologyGenerators(6,2).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
gap> IdQuandle(s);
[ 24, 2 ]
}}}

== Q(10,1) ==

Let us compute the abelian extensions of Q(10,1). The cohomology of Q(10,1) is isomorphic to C2:

{{{
gap> 2ndQuandleCohomologyGenerators(10,1).factors;
[ 2 ]
}}}

With the only non-trivial 2-cocycle one then obtains Q(20,3):

{{{
gap> r := SmallQuandle(10,1);;
gap> f := 2ndQuandleCohomologyGenerators(10,1).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
gap> IdQuandle(s);
[ 20, 3 ]
}}}

Similarly one can construct an abelian extension of Q(20,3). The 2nd
cohomology is now generated by a 2-cocycle g of order 6. 

{{{
gap> 2ndQuandleCohomologyGenerators(20,3).factors;
[ 6 ]
gap> t := AbelianExtension(SmallQuandle(20,3), Group(Flat(g)), g);;
gap> Size(t);
120
}}}

== Q(12,3) ==

We construct an abelian extension of size 120:

{{{
gap> r := SmallQuandle(12,3);;
gap> f := 2ndQuandleCohomologyGenerators(12,3).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(12,5) ==

Here we construct an abelian extension of size 48:

{{{
gap> r := SmallQuandle(12,5);;
gap> f := 2ndQuandleCohomologyGenerators(12,5).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(12,6) ==

We construct an abelian extension of size 48:

{{{
gap> r := SmallQuandle(12,6);;
gap> f := 2ndQuandleCohomologyGenerators(12,6).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

We construct an abelian extension of size 48:

{{{
gap> r := SmallQuandle(12,7);;
gap> f := 2ndQuandleCohomologyGenerators(12,7).generators[2];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(12,9) ==

We construct an abelian extension of size 48:

{{{
gap> r := SmallQuandle(12,9);;
gap> f := 2ndQuandleCohomologyGenerators(12,9).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

We construct an abelian extension of size 48:

{{{
gap> r := SmallQuandle(12,9);;
gap> f := 2ndQuandleCohomologyGenerators(12,9).generators[2];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(12,10) ==

We construct an abelian extension of size 72:

{{{
gap> r := SmallQuandle(12,10);;
gap> f := 2ndQuandleCohomologyGenerators(12,10).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(15,5) ==

We construct an abelian extension of size 75:

{{{
gap> r := SmallQuandle(15,5);;
gap> f := 2ndQuandleCohomologyGenerators(15,5).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(15,6) ==

We construct an abelian extension of size 75:

{{{
gap> r := SmallQuandle(15,6);;
gap> f := 2ndQuandleCohomologyGenerators(15,6).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(16,1) ==

We construct an abelian extension of size 64:

{{{
gap> r := SmallQuandle(16,1);;
gap> f := 2ndQuandleCohomologyGenerators(16,1).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(16,7) ==

We construct an abelian extension of size 64:

{{{
gap> r := SmallQuandle(16,7);;
gap> f := 2ndQuandleCohomologyGenerators(16,7).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,1) ==

We construct an abelian extension of size 108:

{{{
gap> r := SmallQuandle(18,1);;
gap> f := 2ndQuandleCohomologyGenerators(18,1).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,2) ==

We construct an abelian extension of size 36. In this example, we also show the table of the quandle.

{{{
gap> r := SmallQuandle(18,2);;
gap> f := 2ndQuandleCohomologyGenerators(18,2).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
gap> Table(s);
[ [   1,   3,   2,  22,   6,   5,  15,  32,  31,  18,  35,  34,  27,  26,   7,  30,  29,  10,  19,  21,  20,   4,  24,  23,  33,  14,  13,  \
36,  17,  16,   9,   8,  25,  12,  11,  28 ],
  [   3,   2,   1,  24,  23,  22,  14,  13,  15,  35,  34,  18,   8,   7,   9,  29,  28,  12,  21,  20,  19,   6,   5,   4,  32,  31,  33,  \
17,  16,  36,  26,  25,  27,  11,  10,  30 ],
  [   2,   1,   3,   5,   4,  24,  31,  33,  14,  34,  18,  35,  25,   9,  26,  28,  30,  11,  20,  19,  21,  23,  22,   6,  13,  15,  32,  \
16,  36,  17,   7,  27,   8,  10,  12,  29 ],
  [  19,  21,  20,   4,  24,  23,  36,  35,  16,  33,  32,  13,  12,  29,  28,   9,  26,  25,   1,   3,   2,  22,   6,   5,  18,  17,  34,  \
15,  14,  31,  30,  11,  10,  27,   8,   7 ],
  [  21,  20,  19,   6,   5,   4,  17,  34,  36,  32,  13,  33,  11,  28,  30,  26,   7,  27,   3,   2,   1,  24,  23,  22,  35,  16,  18,  \
14,  31,  15,  29,  10,  12,   8,  25,   9 ],
  [  20,  19,  21,  23,  22,   6,  16,  18,  17,  13,  33,  32,  10,  30,  29,   7,   9,   8,   2,   1,   3,   5,   4,  24,  34,  36,  35,  \
31,  15,  14,  28,  12,  11,  25,  27,  26 ],
  [  31,  15,  14,  16,  18,  17,   7,  27,  26,  28,  30,  29,  19,   3,   2,   4,   6,   5,  13,  33,  32,  34,  36,  35,  25,   9,   8,  \
10,  12,  11,   1,  21,  20,  22,  24,  23 ],
  [  15,  14,  31,  36,  35,  16,   9,   8,   7,  30,  29,  28,  21,   2,   1,   6,  23,  22,  33,  32,  13,  18,  17,  34,  27,  26,  25,  \
12,  11,  10,   3,  20,  19,  24,   5,   4 ],
  [  14,  31,  15,  17,  34,  36,  26,  25,   9,  29,  28,  30,  20,   1,   3,  23,   4,  24,  32,  13,  33,  35,  16,  18,   8,   7,  27,  \
11,  10,  12,   2,  19,  21,   5,  22,   6 ],
  [  34,  18,  35,  13,  15,  32,  25,   9,   8,  10,  12,  11,   4,  24,   5,  19,  21,   2,  16,  36,  17,  31,  33,  14,   7,  27,  26,  \
28,  30,  29,  22,   6,  23,   1,   3,  20 ],
  [  18,  35,  34,  33,  14,  13,  27,  26,  25,  12,  11,  10,   6,   5,  22,  21,  20,   1,  36,  17,  16,  15,  32,  31,   9,   8,   7,  \
30,  29,  28,  24,  23,   4,   3,   2,  19 ],
  [  35,  34,  18,  32,  31,  33,   8,   7,  27,  11,  10,  12,  23,  22,  24,  20,  19,   3,  17,  16,  36,  14,  13,  15,  26,  25,   9,  \
29,  28,  30,   5,   4,   6,   2,   1,  21 ],
  [  26,   7,   9,  11,  28,  12,   2,  19,   3,  23,   4,   6,  13,  15,  14,  34,  18,  17,   8,  25,  27,  29,  10,  30,  20,   1,  21,  \
 5,  22,  24,  31,  33,  32,  16,  36,  35 ],
  [   7,   9,  26,  10,  30,  11,   1,  21,   2,   4,   6,  23,  33,  14,  31,  18,  35,  16,  25,  27,   8,  28,  12,  29,  19,   3,  20,  \
22,  24,   5,  15,  32,  13,  36,  17,  34 ],
  [   9,  26,   7,  12,  29,  10,   3,  20,   1,   6,  23,   4,  32,  31,  15,  35,  34,  36,  27,   8,  25,  30,  11,  28,  21,   2,  19,  \
24,   5,  22,  14,  13,  33,  17,  16,  18 ],
  [  11,  10,  12,  26,  25,   9,  23,  22,   6,   2,   1,   3,  31,  33,  32,  16,  36,  35,  29,  28,  30,   8,   7,  27,   5,   4,  24,  \
20,  19,  21,  13,  15,  14,  34,  18,  17 ],
  [  10,  12,  11,   7,  27,  26,   4,  24,  23,   1,   3,   2,  15,  32,  13,  36,  17,  34,  28,  30,  29,  25,   9,   8,  22,   6,   5,  \
19,  21,  20,  33,  14,  31,  18,  35,  16 ],
  [  12,  11,  10,   9,   8,   7,   6,   5,   4,   3,   2,   1,  14,  13,  33,  17,  16,  18,  30,  29,  28,  27,  26,  25,  24,  23,  22,  \
21,  20,  19,  32,  31,  15,  35,  34,  36 ],
  [   1,   3,   2,  22,   6,   5,  15,  32,  31,  18,  35,  34,  27,  26,   7,  30,  29,  10,  19,  21,  20,   4,  24,  23,  33,  14,  13,  \
36,  17,  16,   9,   8,  25,  12,  11,  28 ],
  [   3,   2,   1,  24,  23,  22,  14,  13,  15,  35,  34,  18,   8,   7,   9,  29,  28,  12,  21,  20,  19,   6,   5,   4,  32,  31,  33,  \
17,  16,  36,  26,  25,  27,  11,  10,  30 ],
  [   2,   1,   3,   5,   4,  24,  31,  33,  14,  34,  18,  35,  25,   9,  26,  28,  30,  11,  20,  19,  21,  23,  22,   6,  13,  15,  32,  \
16,  36,  17,   7,  27,   8,  10,  12,  29 ],
  [  19,  21,  20,   4,  24,  23,  36,  35,  16,  33,  32,  13,  12,  29,  28,   9,  26,  25,   1,   3,   2,  22,   6,   5,  18,  17,  34,  \
15,  14,  31,  30,  11,  10,  27,   8,   7 ],
  [  21,  20,  19,   6,   5,   4,  17,  34,  36,  32,  13,  33,  11,  28,  30,  26,   7,  27,   3,   2,   1,  24,  23,  22,  35,  16,  18,  \
14,  31,  15,  29,  10,  12,   8,  25,   9 ],
  [  20,  19,  21,  23,  22,   6,  16,  18,  17,  13,  33,  32,  10,  30,  29,   7,   9,   8,   2,   1,   3,   5,   4,  24,  34,  36,  35,  \
31,  15,  14,  28,  12,  11,  25,  27,  26 ],
  [  31,  15,  14,  16,  18,  17,   7,  27,  26,  28,  30,  29,  19,   3,   2,   4,   6,   5,  13,  33,  32,  34,  36,  35,  25,   9,   8,  \
10,  12,  11,   1,  21,  20,  22,  24,  23 ],
  [  15,  14,  31,  36,  35,  16,   9,   8,   7,  30,  29,  28,  21,   2,   1,   6,  23,  22,  33,  32,  13,  18,  17,  34,  27,  26,  25,  \
12,  11,  10,   3,  20,  19,  24,   5,   4 ],
  [  14,  31,  15,  17,  34,  36,  26,  25,   9,  29,  28,  30,  20,   1,   3,  23,   4,  24,  32,  13,  33,  35,  16,  18,   8,   7,  27,  \
11,  10,  12,   2,  19,  21,   5,  22,   6 ],
  [  34,  18,  35,  13,  15,  32,  25,   9,   8,  10,  12,  11,   4,  24,   5,  19,  21,   2,  16,  36,  17,  31,  33,  14,   7,  27,  26,  \
28,  30,  29,  22,   6,  23,   1,   3,  20 ],
  [  18,  35,  34,  33,  14,  13,  27,  26,  25,  12,  11,  10,   6,   5,  22,  21,  20,   1,  36,  17,  16,  15,  32,  31,   9,   8,   7,  \
30,  29,  28,  24,  23,   4,   3,   2,  19 ],
  [  35,  34,  18,  32,  31,  33,   8,   7,  27,  11,  10,  12,  23,  22,  24,  20,  19,   3,  17,  16,  36,  14,  13,  15,  26,  25,   9,  \
29,  28,  30,   5,   4,   6,   2,   1,  21 ],
  [  26,   7,   9,  11,  28,  12,   2,  19,   3,  23,   4,   6,  13,  15,  14,  34,  18,  17,   8,  25,  27,  29,  10,  30,  20,   1,  21,  \
 5,  22,  24,  31,  33,  32,  16,  36,  35 ],
  [   7,   9,  26,  10,  30,  11,   1,  21,   2,   4,   6,  23,  33,  14,  31,  18,  35,  16,  25,  27,   8,  28,  12,  29,  19,   3,  20,  \
22,  24,   5,  15,  32,  13,  36,  17,  34 ],
  [   9,  26,   7,  12,  29,  10,   3,  20,   1,   6,  23,   4,  32,  31,  15,  35,  34,  36,  27,   8,  25,  30,  11,  28,  21,   2,  19,  \
24,   5,  22,  14,  13,  33,  17,  16,  18 ],
  [  11,  10,  12,  26,  25,   9,  23,  22,   6,   2,   1,   3,  31,  33,  32,  16,  36,  35,  29,  28,  30,   8,   7,  27,   5,   4,  24,  \
20,  19,  21,  13,  15,  14,  34,  18,  17 ],
  [  10,  12,  11,   7,  27,  26,   4,  24,  23,   1,   3,   2,  15,  32,  13,  36,  17,  34,  28,  30,  29,  25,   9,   8,  22,   6,   5,  \
19,  21,  20,  33,  14,  31,  18,  35,  16 ],
  [  12,  11,  10,   9,   8,   7,   6,   5,   4,   3,   2,   1,  14,  13,  33,  17,  16,  18,  30,  29,  28,  27,  26,  25,  24,  23,  22,  \
21,  20,  19,  32,  31,  15,  35,  34,  36 ] ]
}}}

== Q(18,3) ==

We construct an abelian extension of size 72:

{{{
gap> r := SmallQuandle(18,3);;
gap> f := 2ndQuandleCohomologyGenerators(18,3).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,4) ==

We construct an abelian extension of size 216:

{{{
gap> r := SmallQuandle(18,4);;
gap> f := 2ndQuandleCohomologyGenerators(18,4).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,5) ==

We construct an abelian extension of size 216:

{{{
gap> r := SmallQuandle(18,5);;
gap> f := 2ndQuandleCohomologyGenerators(18,5).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,6) ==

We construct an abelian extension of size 72:

{{{
gap> r := SmallQuandle(18,6);;
gap> f := 2ndQuandleCohomologyGenerators(18,6).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,7) ==

We construct an abelian extension of size 72:

{{{
gap> r := SmallQuandle(18,7);;
gap> f := 2ndQuandleCohomologyGenerators(18,7).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,8) ==

We construct an abelian extension of size 108:

{{{
gap> r := SmallQuandle(18,8);;
gap> f := 2ndQuandleCohomologyGenerators(18,8).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,9) ==

We construct an abelian extension of size 36:

{{{
gap> r := SmallQuandle(18,9);;
gap> f := 2ndQuandleCohomologyGenerators(18,9).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,10) ==

We construct an abelian extension of size 36:

{{{
gap> r := SmallQuandle(18,10);;
gap> f := 2ndQuandleCohomologyGenerators(18,10).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,11) ==

We construct an abelian extension of size 108:

{{{
gap> r := SmallQuandle(18,11);;
gap> f := 2ndQuandleCohomologyGenerators(18,11).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(18,12) ==

We construct an abelian extension of size 108:

{{{
gap> r := SmallQuandle(18,12);;
gap> f := 2ndQuandleCohomologyGenerators(18,12).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,1) ==

We construct an abelian extension of size 120:

{{{
gap> r := SmallQuandle(20,1);;
gap> f := 2ndQuandleCohomologyGenerators(20,1).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,2) ==

We construct an abelian extension of size 120:

{{{
gap> r := SmallQuandle(20,2);;
gap> f := 2ndQuandleCohomologyGenerators(20,2).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,3) ==

We construct an abelian extension of size 120:

{{{
gap> r := SmallQuandle(20,3);;
gap> f := 2ndQuandleCohomologyGenerators(20,3).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,4) ==

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,4);;
gap> f := 2ndQuandleCohomologyGenerators(20,4).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,5) ==

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,5);;
gap> f := 2ndQuandleCohomologyGenerators(20,5).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}


We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,5);;
gap> f := 2ndQuandleCohomologyGenerators(20,5).generators[2];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,6) ==

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,6);;
gap> f := 2ndQuandleCohomologyGenerators(20,6).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}


We construct an abelian extension of size 80:

{{{
gap> r := SmallQuandle(20,6);;
gap> f := 2ndQuandleCohomologyGenerators(20,6).generators[2];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,7) ==

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,7);;
gap> f := 2ndQuandleCohomologyGenerators(20,7).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,8) ==

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,8);;
gap> f := 2ndQuandleCohomologyGenerators(20,8).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,9) ==

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,9);;
gap> f := 2ndQuandleCohomologyGenerators(20,9).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

We construct an abelian extension of size 40:

{{{
gap> r := SmallQuandle(20,9);;
gap> f := 2ndQuandleCohomologyGenerators(20,9).generators[2];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(20,10) ==

We construct an abelian extension of size 80:

{{{
gap> r := SmallQuandle(20,10);;
gap> f := 2ndQuandleCohomologyGenerators(20,10).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(21,6) ==

We construct an abelian extension of size 42:

{{{
gap> r := SmallQuandle(21,6);;
gap> f := 2ndQuandleCohomologyGenerators(21,6).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}


We construct an abelian extension of size 42:

{{{
gap> r := SmallQuandle(21,6);;
gap> f := 2ndQuandleCohomologyGenerators(21,6).generators[2];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(21,7) ==

We construct an abelian extension of size 147:

{{{
gap> r := SmallQuandle(21,7);;
gap> f := 2ndQuandleCohomologyGenerators(21,7).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(21,8) ==

We construct an abelian extension of size 147:

{{{
gap> r := SmallQuandle(21,8);;
gap> f := 2ndQuandleCohomologyGenerators(21,8).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}

== Q(21,9) ==

We construct an abelian extension of size 42:

{{{
gap> r := SmallQuandle(21,9);;
gap> f := 2ndQuandleCohomologyGenerators(21,9).generators[1];;
gap> s := AbelianExtension(r, Group(Flat(f)), f);;
}}}