#summary Nichols algebras

We show some examples related to computations of well-known Nichols algebras. 
Most of these computations use the GAP Gröbner basis package [http://mathdox.org/products/gbnp/ gbnp] (written by A. M. Cohen and J. W. Knopper). 

= Functions =

  * `NicholsDatum( rack, q, field )` returns the Nichols algebra over `field` associated to the `rack` and the 2-cocycle `q`.

  * `Dimension( datum, d )` returns the dimension of the homogeneous component of degree `d`.

  * `Relations4GAP( datum, d )` returns the relations of the homogeneous component of degree `d`. 

=== Example. A non-diagonal Nichols algebra of dimension 12 ===

This example appeared in  
*A. Milinski* and *H.-J. Schneider*, Pointed Indecomposable Hopf Algebras over Coxeter Groups, in "New Trends in Hopf Algebra Theory"; _Contemp. Math. 267 (2000)_, 215-236. 

{{{
gap> r := DihedralRack(3);;
gap> q := NullMat(3,3)-1;;
gap> n := NicholsDatum(r, q, Rationals);;
gap> for i in [1..4] do
> Display(Dimension(n, i));
> od;
1
3
4
3
1
}}}

Now we compute the Gröbner basis and the set of relations. For that purpose we
use the GAP Gröbner basis package [http://mathdox.org/products/gbnp/ gbnp] (written by A. M. Cohen and J. W. Knopper). 
{{{
gap> r := DihedralRack(3);;
gap> q := NullMat(3,3)-1;;
gap> n := NicholsDatum(r, q, Rationals);;
gap> K := Relations4GAP(n, 2);;
gap> PrintNPList(K);
 a^2 
 b^2 
 ab + bc + ca 
 ac + ba + cb 
 c^2
gap> G := Grobner(K);;
gap> DimQA(G, 3); 
12
gap> PrintNPList(BaseQA(G, 3, 0));  
 1 
 a 
 b 
 c 
 ab 
 ac 
 ba 
 bc 
 aba 
 abc 
 bac 
 abac 
}}}

Please notice that the functions `PrintNPList`, `Grobner`, `DimQA` and `BasisQA` belong to the gbnp package. They are not included in Rig.